//JSTNAKAT JOB (STPD,EO00),'DRESTR6',MSGLEVEL=(1,1),
//             MSGCLASS=Q,CLASS=P,REGION=0M,
//             RESTART=STKAT000.STKAT000
//JOBLIB   DD DSN=DRESTR6.SS.NA.LY.LOADLIB.FIDELIT3,DISP=SHR
//         DD DSN=SPD.SS.NA.LY.LOADLIB.FIDELIT3,DISP=SHR
//PROCS JCLLIB ORDER=(DRESTR6.SS.NA.LY.PROCLIB)
//STKAT000 EXEC JSTNAKAT,
// HLQ=NV1,HLO=NV1
